BasaDip/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
</mdclass:Enum>

BasaDip/src/CommonModules/НДСКлиентСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции
	
Функция СуммаНДСПоСтавке(Сумма, СтавкаНДС)Экспорт
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		СуммаНДС = Сумма * 0.1 / (1 + 0.1);
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		СуммаНДС = Сумма * 0.2 / (1 + 0.2);
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
		СуммаНДС = 0;
	КонецЕсли;
	
	Возврат СуммаНДС;
КонецФункции

#КонецОбласти
